Repository: elementary/calculator
Catalog: po/extra/*.po
Languages: be, ckb, cs, de, el, es, fa, fr, hu, ko, pl, ru, sk, sv, uk, zh_tw

source: Calculator
be: Калькулятар
ckb: بژمێر
cs: Kalkulačka
de: Rechner
el: Αριθμομηχανή
es: Calculadora
fa: ماشین‌حساب
fr: Calculatrice
hu: Számológép
ko: 계산기
pl: Kalkulator
ru: Калькулятор
sk: Kalkulačka
sv: Kalkylator
uk: Калькулятор
zh_tw: 計算機

source: Solve simple equations
be: Вырашайце нескладаныя ўраўненні
ckb: شیکاکردنی هاوکێشە سادەکان
cs: Řešte jednoduché výpočty
de: Einfache Gleichungen lösen
el: Λύστε απλές εξισώσεις
es: Resuelva ecuaciones simples
fa: حل معادلات ساده
fr: Résoudre de simples équations
hu: Egyszerű műveletek megoldása
ko: 간단한 방정식 풀이
pl: Rozwiązuj proste równania
ru: Решайте простые уравнения
sk: Riešte jednoduché výpočty
sv: Lös enkla ekvationer
uk: Розв'язуйте прості рівняння
zh_tw: 解決簡單運算

source: A simple calculator for everyday use. It supports basic and some scientific calculations including trigonometry functions, sin, cos, and tan.
be: Просты калькулятар для штодзённага выкарыстання. Ён падтрымлівае ўсе базавыя і некаторыя навуковыя вылічэнні, напрыклад трыганаметрычныя функцыі, сінусы, косінусы і тангенсы.
ckb: بژمێرێکی سادە بۆ کاوروباری هەمووان. ئەم بژمێرە شیکاری هاوکێشە سادەکان و هەندێک هاوکێشەی زانستی وەکو ساین، کۆساین، و تان لەخۆ دەگرێت.
cs: Jednoduchá kalkulačka pro každodenní použití. Podporuje základní a některé vědecké výpočty, včetně goniometrických funkcí sinus, kosinus a tangens.
de: Ein schlichter Taschenrechner für den Alltag. Er beherrscht alle grundlegenden und einige wissenschaftliche Rechenoperationen, einschließlich trigonometrischer Funktionen wie Sinus, Kosinus und Tangens.
el: Μια απλή αριθμομηχανή για καθημερινή χρήση. Υποστηρίζει βασικές και μερικές επιστημονικές πράξεις, συμπεριλαμβανομένων των τριγωνομετρικών πράξεων ημθ, συνθ και εφθ.
es: Una sencilla calculadora para el uso diario. Es compatible con cálculos básicos y algunos científicos, incluidas las funciones trigonométricas seno, coseno y tangente.
fa: یک ماشین حساب ساده برای استفاده روزمره. از محاسبات پایه و برخی علمی از جمله توابع مثلثات، sin، cos و tan پشتیبانی می کند.
fr: Une calculatrice simple conçue pour l'usage quotidien. Elle permet de faire des calculs basiques et scientifiques, y compris les fonctions trigonométriques sinus, cosinus, tangente.
hu: Egy egyszerű számológép mindennapi használatra. Képes egyszerű és tudományos számításra, például: trigonometrikus függvények, sin, cos, tg.
ko: 일상에 사용하는 간편한 계산기. 기본 연산과 삼각함수, 사인, 코사인, 탄젠트의 과학용 연산도 지원합니다.
pl: Prosty kalkulator do codziennego użytku. Zawiera podstawowe obliczenia oraz kilka funkcji naukowych, w tym trygonometryczne: sinus, cosinus oraz tangens.
ru: Простой калькулятор для повседневного использования. Он поддерживает базовые и некоторые научные расчёты, включая тригонометрические функции, синус, косинус и тангенс.
sk: Jednoduchá kalkulačka pre každodenné použitie. Podporuje základné a niektoré vedecké výpočty, vrátane goniometrických funkcií sin, cos a tan.
sv: En enkel kalkylator för vardaglig använding. Den har stöd för basfunktioner och några vetenskapliga funktioner såsom trigonometrifunktionerna sin, cos och tan.
uk: Простий калькулятор для повсякденного вжитку. Підтримує базові та деякі інженерні обчислення, включно з тригонометричними функціями, синусом, косинусом і тангенсом.
zh_tw: 日用的簡單計算機。支援基本計算和一些科學計算，包括三角函數，如 sin、cos、和 tan 等。

source: Minor updates:
be: Нязначныя абнаўленні:
ckb: وردە نوێکاری:
cs: Drobné aktualizace:
de: Weitere Aktualisierungen:
el: Μικρές ενημερώσεις:
es: Actualizaciones menores:
fa: آپدیت جزئی:
fr: Mises à jour mineures :
hu: Apróbb frissítések:
ko: 소소한 업데이트:
pl: Drobne poprawki:
ru: Незначительные обновления:
sk: Drobné aktualizácie:
sv: Mindre uppdateringar:
uk: Незначні оновлення:
zh_tw: 微幅更新：

source: Redesigned app icon
be: Зменены значок праграмы
el: Επανασχεδιασμένο εικονίδιο
fa: آیکون برنامه بازطراحی شده
ru: Переработана иконка приложения
sk: Aktualizovaná ikonka aplikácie
sv: Omdesignad appikon

source: Flat titlebar
be: Плоская верхняя панэль
el: Επίπεδη μπάρα τίτλου
fa: نوار عنوان تخت
ru: Использовать плоский заголовок
sk: Plochá horná lišta okna
sv: Platt titelfält

source: Updated translations
be: Абноўлены пераклады
ckb: وەرگێڕدراوە نوێکان
cs: Aktualizovány překlady
de: Aktualisierte Übersetzungen
el: Ενημερωμένες μεταφράσεις
es: Traducciones actualizadas
fa: ترجمه های به روز شده
fr: Mise à jour des traductions
hu: Új fordítások
ko: 최신 번역
pl: Zaktualizowano tłumaczenia
ru: Обновлены переводы
sk: Aktualizované preklady
sv: Uppdaterade översättningar
uk: Оновлення перекладів
zh_tw: 已改善的翻譯

source: Update for OS 7 and Gtk 4
be: Абнаўленні да OS 7 і Gtk 4
el: Ενημέρωση για το OS 7 και το GTK 4
fa: به روز رسانی برای OS 7 و Gtk 4
fr: Mise à jour pour OS 7 et Gtk 4
hu: Frissítés OS 7-hez és Gtk 4-re
ru: Обновлено до OS 7 и Gtk 4
sk: Aktualizované pre OS 7 a Gtk 4
sv: Uppdatering för OS 7 och Gtk 4
uk: Оновлення для OS 7 і Gtk 4

source: Update to elementary 6.1 runtime
ckb: نوێکردنەوە بۆ ڕەنتایمی ئێلێمەنتەری ٦.١
cs: Běhové prostředí elementary aktualizováno na verzi 6.1
fr: Mise à jour vers l'exécutable elementary 6.1
hu: Frissítés az elementary 6.1-es futtatókörnyezetre
ko: elementary 6.1 runtime으로 업데이트
pl: Zaktualizowano do wersji elementary 6.1
ru: Обновление среды выполнения elementary до версии 6.1
sk: Behové prostredie elementary aktualizované na verziu 6.1
uk: Оновлення середовища виконання elementary до версії 6.1
zh_tw: 請更新運行庫到elementary 6.1版本

source: Showing advanced controls only affects the focused window
ckb: پشاندنی کۆنتڕۆڵی پێشکەوتوو تەنها کاریگەری لەسەر پەنجەری کارا دەبێت
cs: Zobrazování pokročilých ovládacích prvků se týká pouze zaměřeného okna
de: Das Anzeigen erweiterter Schaltflächen betrifft nun nur noch das ausgewählte Fenster
fr: L'affichage des contrôles avancés n'affecte désormais que la fenêtre au premier plan
hu: A speciális vezérlők megjelenítése csak a fókuszált ablakot érinti
ko: 고급 컨트롤을 표시하면 초점이 맞춰진 창에만 영향을 줍니다
pl: Pokazywanie zaawansowanych kontrolek wpływa teraz tylko na skupione okno
ru: Показ дополнительных функций затрагивает только окно в фокусе
sk: Zobrazenie pokročilých ovládacích prvkov ovplyvní iba aktívne okno
uk: Додаткові елементи керування відкриваються лише у сфокусованому вікні
zh_tw: “顯示高級控件”設定僅對當前窗口生效

source: Focus the main text entry on startup
ckb: سەرنج بخە سەر دەقی سەرەکی هاتنەناو لە کاتی دەست پێ کردن
cs: Po spuštění zaměřit hlavní textový vstup
de: Den Haupt-Texteintrag beim Start auswählen
fr: Sélection du champ de saisie principal au démarrage
ko: 시작 시 기본 텍스트 항목에 초점 맞추기
pl: Przy starcie skupienie ustawione jest teraz na głównym wejściu tekstowym
ru: Переключение фокуса на поле ввода текста при запуске
sk: Pri štarte označiť hlavné textové pole
uk: Фокусування на основному текстовому полі під час запуску
zh_tw: 啟動時聚焦主要文本條目

source: Show the correct window title in Multitasking View
ckb: پیشاندانی تایتڵی دروستی پەنجەرەکان لە مەڵتی-تاسکیندا
cs: Zobrazení správného titulku okna ve víceúlohovém zobrazení
de: Zeigt den korrekten Fenstertitel in der Multitasking-Ansicht an
fr: Affichage correct du nom de la fenêtre dans la vue multitâche
ko: 멀티태스킹 보기에서 올바른 창 제목 표시
pl: Naprawiono pokazywanie poprawnego tytułu okienko w widoku wielozadaniowym
ru: Отображение правильного заголовка окна в режиме многозадачности
sk: Zobrazovať správny názov okna v Zobrazení okien
uk: Показ правильного заголовка вікна у багатозадачному режимі
zh_tw: 在多任務視圖中顯示具體窗口標題

source: Added 'New Window' Desktop Action
ckb: کرداری ڕوومێزی 'پەنجەری تازە' زیاد کرا
cs: Přidána akce plochy „Nové okno“
de: "Neues Fenster" als Schreibtischaktion hinzugefügt
fr: Ajout de l'action « Nouvelle fenêtre »
ko: '새 창' 데스크톱 작업 추가
pl: Dodano akcję pulpitu 'Nowe okno'
ru: Добавлена возможность открытия нового окна из меню в доке
sk: Pridaná nová akcia pracovnej plochy ‚Nové okno‘
uk: Додано дію «Нове вікно»
zh_tw: 已添加“新窗口”桌面操作

source: New features:
ckb: تایبەتمەندییە تازەکان:
cs: Nové funkce:
de: Neue Funktionen:
es: Funcionalidades nuevas:
fr: Nouvelles fonctionnalités :
hu: Új funkciók:
ko: 새로운 기능:
pl: Nowe funkcje:
ru: Новые возможности:
sk: Nové funkcie:
uk: Нові функції:
zh_tw: 新特性：

source: Add a "Clear History" button to the history dialog
ckb: زیادکردنی دوگمەیەکی "سڕینەوەی مێژوو" بۆ دایەلۆگی مێژوو
cs: Přidáno tlačítko „Smazat historii“ do dialogu historie
de: "Verlauf löschen"-Button im Verlaufsdialog hinzugefügt
es: Añade el botón «Vaciar historial» en el diálogo Historial
fr: Ajout d'un bouton « Effacer l'historique » dans la boîte de dialogue de l'historique
ko: 기록 대화 상자에 "기록 지우기" 버튼 추가
pl: Dodaj przycisk "Wyczyść historię" do okna dialogowego historii
ru: Добавлена кнопка «Очистить историю» в диалог истории
sk: Pridané tlačidlo „Vymazať históriu“ do dialógu histórie
uk: Додано кнопку «Очистити історію» до вікна історії
zh_tw: 將“清除歷史記錄”按鈕添加到歷史記錄對話框中

source: Fixed an issue with multiple windows
ckb: کێشەیەک لەگەڵ چەند پەنجەرەیەک چارەسەر کراوە
de: Ein Fehler mit mehreren geöffneten Fenstern wurde korrigiert
es: Se solucionó un problema con varias ventanas
fr: Correction d'un problème lorsque plusieurs fenêtres sont ouvertes
ko: 다중 창 문제 수정
pl: Naprawiono błąd z kilkoma oknami
ru: Исправлена проблема с несколькими окнами
sk: Opravený problém s viacerými oknami
uk: Виправлено проблему з кількома вікнами
zh_tw: 修復了一個有關多窗體的問題

source: More informative copy in history dialog
ckb: وێنەیەکی زانیاری زیاتر لە دایەلۆگی مێژوودا
de: Weitere Informationen im Verlaufsdialog
es: Texto más informativo en el cuadro de diálogo del historial
fr: Copie plus informative dans la boîte de dialogue de l'historique
ko: 기록 목록에서 더 많은 정보 복사
pl: Bardziej informatywna kopia w oknie dialogowym historii
ru: Более информативная копия в диалоговом окне истории
sk: Viac informatívna kópia v dialógu histórie
uk: Інформативніша копія в діалоговому вікні історії
zh_tw: 在歷史記錄對話框中提供更有用的存檔

source: Add log and inverse trigonometric functions
ckb: زیادکردنی لۆگ و کردارە سێگۆشەییە پێچەوانەکان
de: Logarithmische Funktionen und Arkusfunktionen hinzufügt
es: Se añadieron el logaritmo y funciones trigonométricas inversas
fr: Ajout des fonctions logarithmiques et trigonométriques inverses
ko: 로그 및 역삼각 함수 추가
pl: Dodaj funkcje logarytmiczne i odwrotne funkcje trygonometryczne
ru: Добавлен журнал и обратные тригонометрические функции
sk: Pridaný logaritmus a inverzné goniometrické funkcie
uk: Додано журнал та обернені тригонометричні функції
zh_tw: 新增對數及反三角函數功能

source: Other updates:
ckb: نوێکارییەکانی تر:
de: Weitere Aktualisierungen:
es: Otras actualizaciones:
fr: Autres mises à jour :
hu: Egyéb frissítések:
ko: 기타 업데이트:
pl: Inne aktualizacje:
ru: Остальные обновления:
sk: Iné aktualizácie:
uk: Інші оновлення:
zh_tw: 其他更新:

source: Fix an issue with negative decimals without leading digits
ckb: چارەسەرکردنی کێشەیەک لە دەییە سالبەکان بەبێ ژمارەی پێشەنگ
de: Fehlerbehebung: negative Dezimalzahl ohne führende Ziffer
es: Se solucionó un problema con decimales negativos sin dígitos iniciales
fr: Correction d'un problème avec les décimales négatives, sans chiffres avant la virgule
ko: 선행 숫자가 없는 음수 소수 문제 수정
pl: Napraw problem ujemnych liczb dziesiętnych bez cyfr początkowych
ru: Исправлена проблема с отрицательными десятичными дробями без начальных цифр
sk: Opravený problém s negatívnymi desatinnými číslami bez vedúcich číslic
uk: Виправлено проблему з від’ємними десятковими цифрами без початкових цифр
zh_tw: 修正負點數無顯示首位數字

source: More efficient state saving
ckb: پاشەکەوتکردنی دۆخی کاراتر
de: Effizientere Statussicherung
es: Se guarda el estado más eficientemente
fr: Sauvegarde de l'état de l'application plus efficace
ko: 보다 효율적인 상태 저장
pl: Bardziej efektywne zapisanie stanu
ru: Более эффективное сохранение исходного состояния
sk: Efektívnejšie ukladanie stavu
uk: Ефективніше стан збереження
zh_tw: 優化狀態儲存速度

source: Use slim titlebar
ckb: بەکارهێنانی تایتڵباڕێکی باریک
de: Verwendung einer schmalen Titelleiste
es: Se redujo la altura de la barra de título
fr: Utilisation d'une barre de titre plus fine
hu: Vékony címsor használata
ko: 얇은 제목 줄 사용
pl: Użyj smukłego paska tytułu
ru: Использовать тонкий заголовок
sk: Použitá tenšia lišta okna
uk: Потоншено панель заголовка
zh_tw: 使用更細的標題列

source: Fix inserting multi-byte characters
ckb: چارەسەری نووسینی کارێکتەری مەڵتی بایت
de: Korrektur beim Einfügen von Multi-Byte-Zeichen
es: Se corrigió la inserción de caracteres de varios bytes
fr: Correction de l'insertion de caractères pluri-octets
hu: Többájtos karakterek beillesztésének javítása
ko: 멀티바이트 문자를 삽입할 때의 버그를 수정
pl: Naprawiono wstawianie wielobajtowych znaków
ru: Исправлена вставка многобайтовых символов
sk: Opravené vkladanie viacbajtových znakov
uk: Виправлено вставляння багаторозрядних символів
zh_tw: 修復插入多字節字符的問題

source: Fix missing icon for Ukrainian
ckb: چارەسەرکردنی ئایکۆنی ونبوو بۆ ئۆکراینا
de: Fehlendes Icon für Ukrainisch korrigiert
es: Corrección del icono faltante para ucraniano
fr: Correction de l'icône manquante en ukrainien
hu: Hiányzó ukrán zászló pótlása
ko: 우크라이나어용 아이콘 수정됨
pl: Naprawiono brakującą ikonę dla języka ukraińskiego
ru: Исправлена отсутствующая иконка для украинской локализации
sk: Opravená chýbajúca ikonka pre ukrajinčinu
uk: Виправлено проблему відсутності піктограми для версії українською
zh_tw: 修復烏克蘭語下丟失的圖標的問題

source: Animate Infobar when hiding and showing
ckb: زیادکردنی ئەنیمەیشن بۆ ئینفۆباڕ لە کاتی پیشاندان و شاردنەوە
de: Animierte Informationsleiste beim Verstecken und Wiederherstellen
es: Barra de información animada al ocultar y mostrar
fr: Animation de la barre d'information lors de son affichage
hu: Az infósáv animálása elrejtéskor vagy mutatáskor
ko: 인포바(Infobar)가 숨겨지거나 나타날 때 애니메이션 처리함
pl: Animuj pasek informacyjny podczas chowania lub wyświetlania
ru: Анимировано скрытие и появление панели сведений
sk: Animácia pre zobrazenie a skrytie infopanela
uk: Анімація приховування й показу інфопанелі
zh_tw: 啟用資訊欄顯示及隱藏動畫

source: Fix selection replace
ckb: چارەسەری جێگری دیاریکردن
de: Korrektur von Markierung ersetzen
es: Corrección del reemplazo de selección
fr: Correction du remplacement du texte sélectionné
hu: Kijelölés cseréje javítása
ko: 선택 바꾸기 수정
pl: Napraw zamianę zaznaczenia
ru: Исправлена замена выбранного текста
sk: Opravené nahradenie výberu
uk: Виправлено заміну виділення
zh_tw: 修復選定內容替換的問題

source: Improved decimal separator localization
ckb: گەشە بە لۆکاڵیزەیشنی جیاکەرەوەی دەیی دراوە
de: verbesserte Lokalisierung für Dezimaltrenner
es: Regionalización de separador decimal mejorada
fr: Amélioration du support de la traduction du séparateur des nombres
hu: Javított decimális elválasztó lokalizáció
ko: 소수점의 로컬라이제이션의 개선
pl: Zmieniono lokalizację separatora liczb dziesiętnych
ru: Улучшена локализация разделителя десятичных дробей
sk: Vylepšená lokalizácia desatinného oddeľovača
uk: Поліпшено локалізацію десяткового розділювача
zh_tw: 優化小數分隔符的位置

source: Calculation;Mathematics;Arithmetic;Scientific;
be: Вылічэнні;Вылічэнне;Вылічванне;Матэматыка;Арыфметыка;Навуковы;
ckb: ژماردن; بیرکاری; ژمێرکاری; زانستی;
cs: Výpočty;Matematika;Aritmetika;Vědecká;
de: Rechner;Taschenrechner;Mathematik;Arithmetik;Wissenschaftlich;
el: Υπολογισμός;Μαθηματικά;Αριθμητική;Κομπιουτεράκι;Επιστημονική;Νούμερα;Αριθμός;Αριθμομηχανή;
es: Cálculo;Matemáticas;Aritmética;Científica;
fa: محاسبات;ریاضی;حساب;علمی;
fr: Calculs;Mathématiques;Maths;Arithmétique;Scientifique;Sommes;Divisions;Soustractions;Multiplications;Pourcentages;Fraction;
hu: Alap;Matematikai;Aritmetikai;Informatikus;Tudományos;
ko: 계산;수학;산술;과학;
pl: Kalkulator;Matematyka;Arytmetyka;Naukowy;
ru: Calculation;Mathematics;Arithmetic;Scientific;Вычисления;Математика;Арифметика;Научный;
sk: Výpočty;Matematika;Aritmetika;Vedecká;
sv: Beräkning;Matematik;Aritmetik;Vetenskaplig;
uk: Обчислення;Математика;Арифметика;Науковий;
zh_tw: 計算器;數學;算數;科學運算;

source: New Window
be: Новае акно
ckb: پەنجەرەی تازە
cs: Nové okno
de: Neues Fenster
el: Νέο παράθυρο
fa: پنجره جدید
fr: Nouvelle fenêtre
hu: Új ablak
ko: 새 창
pl: Nowe okno
ru: Новое окно
sk: Nové okno
sv: Nytt fönster
uk: Нове вікно
zh_tw: 新視窗

source: elementary, Inc.
ckb: کۆمپانیای هاوپشکی ئێلێمەنتەری.

source: Replace "Del" button with an icon
be: Кнопка "Del" цяпер значок
el: Αντικατάσταση του κουμπιού "Del" με εικονίδιο
sv: Ersätt "Del"-knappen med en ikon

source: Branding color changed to Mint 500
be: Колер брэндынгу зменены на Мятны 500
el: Το χρώμα του σήματος άλλαξε στο Μέντα 500
fa: رنگ برند به Mint 500 تغییر کرد
sv: Färgen på varumärket ändrades till Mint 500

source: Always use elementary styles and icons, even on other platforms
be: Заўсёды выкарыстоўваюцца стылі і значкі elementary, нават на іншых платформах
el: Πάντα χρησιμοποιεί τα στιλ και εικονίδια της elementary, ακόμη και σε άλλες πλατφόρμες
fa: همیشه از استایل و آیکون های المنتری استفاده کنید حتی در پلتفرم های دیگر
sv: Använd alltid elementary-stilar och ikoner, även på andra plattformar

source: Always paste text with the keyboard shortcut "Ctrl + V"
be: Устаўка тэксту на "Ctrl + V" цяпер заўжды працуе
el: Επικόλληση κειμένου πλέον πάντα με την συντόμευση πληκτρολογίου "Ctrl + V"
fa: همیشه متن را با میانبر صفحه کلید "Ctrl + V" جای‌گذاری کنید
sv: Klistra alltid in text med tangentbordsgenvägen "Ctrl + V"
