Repository: elementary/calculator
Catalog: po/*.po
Languages: ckb

source: Calculator
ckb: بژمێر

source: Show extended functionality
ckb: پیشاندانی بژمێری پێشکەوتوو

source: History
ckb: مێژوو

source: Calculate Result
ckb: ئەنجام بژمێرە

source: Insert last result
ckb: کۆتا ئەنجام بهێنە

source: Backspace
ckb: گەڕانەوە

source: Clear entry
ckb: سڕینەوەی شاشە

source: Add
ckb: کۆکردنەوە

source: Subtract
ckb: کەمکردنەوە

source: Multiply
ckb: جاران

source: Divide
ckb: دابەش

source: Percentage
ckb: ڕێژەی سەدی

source: Set memory value
ckb: دانانی بەهای بیرگە

source: Recall value from memory
ckb: بانگکردنەوەی بەها لە بیرگە

source: Add to stored value
ckb: زیادکردن بۆ بەهای پاشەکەوت کراو لە بیرگەدا

source: Subtract from stored value
ckb: کەمکردنەوە لە بەهای پاشەکەوت کراو لە بیرگەدا

source: Clear memory
ckb: پاککردنەوەی بیرگە

source: Grand Total
ckb: کۆی گشتی

source: Start Group
ckb: کەوانە (کردنەوە)

source: End Group
ckb: کەوانە (داخستن)

source: Exponent
ckb: توان

source: Root
ckb: ڕەگ

source: Sine
ckb: ساین

source: Hyperbolic Sine
ckb: نەخشەی تەژێ زیاد

source: Cosine
ckb: کۆساین

source: Hyperbolic Cosine
ckb: نەخشەی تەژێ تەواوی زیاد

source: Tangent
ckb: لێکەوت

source: Hyperbolic Tangent
ckb: بڕگە زیادی لێکەوت

source: Pi
ckb: پای

source: Euler's Number
ckb: ژمارەی ئویلەر

source: Logarithm Base 10
ckb: بنچینەی لۆگاریتمی ١٠

source: Natural Logarithm
ckb: لۆگاریتمی سروشتی

source: Inverse Sine
ckb: تەژێ پێچەوانە

source: Inverse Cosine
ckb: کۆساینی پێچەوانە

source: Inverse Tangent
ckb: لێکەوتی پێچەوانە

source: Reciprocal
ckb: ئاڵوگۆڕ

source: Hide extended functionality
ckb: گەڕانەوە بۆ بژمێری سادە

source: Insert a previous expression or result into the current calculation.
ckb: هێنانی دەستەواژە یان ئەنجامی پێشوو بۆ ناو خانەی بژمێر.

source: Value to insert:
ckb: ئەو بەهایەی کە دەهێندرێتەوە:

source: Result
ckb: ئەنجام

source: Expression
ckb: دەستەواژە

source: Clear History
ckb: سڕینەوەی مێژوو

source: Close
ckb: داخستن

source: Insert
ckb: هێنان

source: '%s' is invalid.
ckb: '%s' نادروستە.

source: Mismatched parenthesis.
ckb: هەڵە لە کەوانەکاندا هەیە.

source: '%s' is unknown.
ckb: '%s' نەناسراوە.
